Revit 2024 API
Checker.CheckerColor1 Property
 The property labeled "Color 1" from the "Checker" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string CheckerColor1 { get; }
Visual Basic
Public Shared ReadOnly Property CheckerColor1 As String
	Get
Visual C++
public:
static property String^ CheckerColor1 {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Checker Class
Autodesk.Revit.DB.Visual Namespace